{"config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "sparse": false, "name": "input_1", "dtype": "float32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "conv1", "data_format": "channels_last", "strides": [2, 2], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [7, 7], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn_conv1", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "bn_conv1"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res2a_branch2a", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_constraint": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "res2a_branch2a"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn2a_branch2a", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "name": "bn2a_branch2a"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "name": "activation_2"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res2a_branch2b", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_constraint": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "res2a_branch2b"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn2a_branch2b", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "name": "bn2a_branch2b"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "name": "activation_3"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res2a_branch2c", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "kernel_constraint": null}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "res2a_branch2c"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res2a_branch1", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "kernel_constraint": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "res2a_branch1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn2a_branch2c", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "name": "bn2a_branch2c"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn2a_branch1", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "name": "bn2a_branch1"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "name": "add_1"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_4"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res2b_branch2a", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_constraint": null}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "res2b_branch2a"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn2b_branch2a", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "name": "bn2b_branch2a"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "name": "activation_5"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res2b_branch2b", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_constraint": null}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "res2b_branch2b"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn2b_branch2b", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "name": "bn2b_branch2b"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "name": "activation_6"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res2b_branch2c", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "kernel_constraint": null}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "res2b_branch2c"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn2b_branch2c", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "name": "bn2b_branch2c"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_4", 0, 0, {}]]], "name": "add_2"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "activation_7"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res2c_branch2a", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_constraint": null}, "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "res2c_branch2a"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn2c_branch2a", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "name": "bn2c_branch2a"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "name": "activation_8"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res2c_branch2b", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_constraint": null}, "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "res2c_branch2b"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn2c_branch2b", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "name": "bn2c_branch2b"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "name": "activation_9"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res2c_branch2c", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "kernel_constraint": null}, "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "res2c_branch2c"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn2c_branch2c", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "name": "bn2c_branch2c"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_7", 0, 0, {}]]], "name": "add_3"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "activation_10"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res3a_branch2a", "data_format": "channels_last", "strides": [2, 2], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "kernel_constraint": null}, "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "res3a_branch2a"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn3a_branch2a", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "name": "bn3a_branch2a"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "name": "activation_11"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res3a_branch2b", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "kernel_constraint": null}, "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "res3a_branch2b"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn3a_branch2b", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "name": "bn3a_branch2b"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_12"}, "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "name": "activation_12"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res3a_branch2c", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 512, "kernel_constraint": null}, "inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "res3a_branch2c"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res3a_branch1", "data_format": "channels_last", "strides": [2, 2], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 512, "kernel_constraint": null}, "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "res3a_branch1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn3a_branch2c", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]], "name": "bn3a_branch2c"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn3a_branch1", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]], "name": "bn3a_branch1"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]], "name": "add_4"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_13"}, "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_13"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res3b_branch2a", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "kernel_constraint": null}, "inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "res3b_branch2a"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn3b_branch2a", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]], "name": "bn3b_branch2a"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_14"}, "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]], "name": "activation_14"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res3b_branch2b", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "kernel_constraint": null}, "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "res3b_branch2b"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn3b_branch2b", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]], "name": "bn3b_branch2b"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_15"}, "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]], "name": "activation_15"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res3b_branch2c", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 512, "kernel_constraint": null}, "inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "res3b_branch2c"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn3b_branch2c", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]], "name": "bn3b_branch2c"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_5"}, "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_13", 0, 0, {}]]], "name": "add_5"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_16"}, "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "activation_16"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res3c_branch2a", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "kernel_constraint": null}, "inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "res3c_branch2a"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn3c_branch2a", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]], "name": "bn3c_branch2a"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_17"}, "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]], "name": "activation_17"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res3c_branch2b", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "kernel_constraint": null}, "inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "res3c_branch2b"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn3c_branch2b", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]], "name": "bn3c_branch2b"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_18"}, "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]], "name": "activation_18"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res3c_branch2c", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 512, "kernel_constraint": null}, "inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "res3c_branch2c"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn3c_branch2c", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]], "name": "bn3c_branch2c"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_6"}, "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_16", 0, 0, {}]]], "name": "add_6"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_19"}, "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "activation_19"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res3d_branch2a", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "kernel_constraint": null}, "inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "res3d_branch2a"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn3d_branch2a", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]], "name": "bn3d_branch2a"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_20"}, "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]], "name": "activation_20"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res3d_branch2b", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "kernel_constraint": null}, "inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "res3d_branch2b"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn3d_branch2b", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]], "name": "bn3d_branch2b"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_21"}, "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]], "name": "activation_21"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res3d_branch2c", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 512, "kernel_constraint": null}, "inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "res3d_branch2c"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn3d_branch2c", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]], "name": "bn3d_branch2c"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_7"}, "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_19", 0, 0, {}]]], "name": "add_7"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_22"}, "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "activation_22"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res4a_branch2a", "data_format": "channels_last", "strides": [2, 2], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "kernel_constraint": null}, "inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "res4a_branch2a"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn4a_branch2a", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]], "name": "bn4a_branch2a"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_23"}, "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]], "name": "activation_23"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res4a_branch2b", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "kernel_constraint": null}, "inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "res4a_branch2b"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn4a_branch2b", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]], "name": "bn4a_branch2b"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_24"}, "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]], "name": "activation_24"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res4a_branch2c", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 1024, "kernel_constraint": null}, "inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "res4a_branch2c"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res4a_branch1", "data_format": "channels_last", "strides": [2, 2], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 1024, "kernel_constraint": null}, "inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "res4a_branch1"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn4a_branch2c", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]], "name": "bn4a_branch2c"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn4a_branch1", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]], "name": "bn4a_branch1"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_8"}, "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]], "name": "add_8"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_25"}, "inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "activation_25"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res4b_branch2a", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "kernel_constraint": null}, "inbound_nodes": [[["activation_25", 0, 0, {}]]], "name": "res4b_branch2a"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn4b_branch2a", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]], "name": "bn4b_branch2a"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_26"}, "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]], "name": "activation_26"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res4b_branch2b", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "same", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "kernel_constraint": null}, "inbound_nodes": [[["activation_26", 0, 0, {}]]], "name": "res4b_branch2b"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn4b_branch2b", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]], "name": "bn4b_branch2b"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_27"}, "inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]], "name": "activation_27"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res4b_branch2c", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 1024, "kernel_constraint": null}, "inbound_nodes": [[["activation_27", 0, 0, {}]]], "name": "res4b_branch2c"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn4b_branch2c", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null}, "inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]], "name": "bn4b_branch2c"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_9"}, "inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_25", 0, 0, {}]]], "name": "add_9"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_28"}, "inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "activation_28"}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "linear", "name": "res4c_branch2a", "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 4.999999873689376e-05}, "class_name": "L1L2"}, "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "kernel_constraint": null}, "inbound_nodes": [[["activation_28", 0, 0, {}]]], "name": "res4c_branch2a"}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.95, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "bn4c_branch2a", "scale": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "axis": 3, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, 